hacking/mobile/android/3. 안드로이드 앱 진단/owasp-mobile-top10-2016.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OWASP MOBILE TOP 10 2016 분석</title>
<!-- 2018-05-31 목 15:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">OWASP MOBILE TOP 10 2016 분석</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 개요</a></li>
<li><a href="#sec-2">2. M1 : 적절하지 않은 플랫폼 사용 (Improper Platform Usage)</a></li>
<li><a href="#sec-3">3. M2 : 취약한 데이터 저장소 (Insecure Data Storage)</a>
<ul>
<li><a href="#sec-3-1">3.1. Case 1. 암호키가 앱 소스코드에 하드코딩되어 있는 경우</a></li>
</ul>
</li>
<li><a href="#sec-4">4. M3 : 취약한 통신 (Insecure Communication)</a>
<ul>
<li><a href="#sec-4-1">4.1. 침투 테스터가 자주 발견하는 시나리오</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. 인증서 검사 부족</a></li>
<li><a href="#sec-4-1-2">4.1.2. 약한 핸드쉐이크 협상</a></li>
<li><a href="#sec-4-1-3">4.1.3. 개인정보유출</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. iOS 모범 사례</a></li>
<li><a href="#sec-4-3">4.3. 안드로이드 모범 사례</a></li>
</ul>
</li>
<li><a href="#sec-5">5. M4 : 취약한 인증 (Insecure Authentication)</a>
<ul>
<li><a href="#sec-5-1">5.1. 보안대책</a></li>
</ul>
</li>
<li><a href="#sec-6">6. M5 : 불충분한 암호화 (Insufficient Cryptography)</a>
<ul>
<li><a href="#sec-6-1">6.1. 시나리오</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. 취약한 키 관리 프로세스</a></li>
<li><a href="#sec-6-1-2">6.1.2. 커스텀 암호화 프로토콜 제작 및 사용</a></li>
<li><a href="#sec-6-1-3">6.1.3. 취약한 알고리즘 및 미검증 알고리즘 사용</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. M6 : 취약한 권한 부여 (Insecure Authorization)</a></li>
<li><a href="#sec-8">8. M7 : 취약한 코드 품질 (Client Code Quality)</a></li>
<li><a href="#sec-9">9. M8 : 코드 변조 (Code Tampering)</a></li>
<li><a href="#sec-10">10. M9 : 역공학 (Reverse Engineering)</a></li>
<li><a href="#sec-11">11. M10 : 불필요한 기능 (Extraneous Functionality)</a></li>
<li><a href="#sec-12">12. 참고 자료</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 개요</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>2016 발표한 OWASP 모바일 TOP 10 취약점을 분석한 문서입니다.
</li>
<li>순서대로 위험도를 나타냅니다.
</li>
<li>2018년 5월 기준 가장 최신입니다.
</li>
<li>다양한 케이스(시나리오)를 추가해서 보완해보려고 합니다.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> M1 : 적절하지 않은 플랫폼 사용 (Improper Platform Usage)</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>전통적인 OWASP TOP 10 취약점을 통해 사용할 수 있는 공격 벡터를 사용(XSS, 각종 Injection 등)
</li>
<li>모바일 앱에서 사용하는 웹 서비스나 API가 노출되어야 함
</li>
<li>서버측 API가 취약한 경우 (입력 값 검증 미비/출력값 이스케이핑 처리 미비 등)
</li>
<li>대응 방법은 OWASP TOP 10 대응방법과 동일
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> M2 : 취약한 데이터 저장소 (Insecure Data Storage)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>안전하지 않은 데이터 저장소 및 의도하지 않은 데이터 누출
</li>
<li>SQL DB, 로그파일, XML 파일, 바이너리 데이터 저장소, 쿠키 저장소, SD 카드, 클라우드 동기화 등
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Case 1. 암호키가 앱 소스코드에 하드코딩되어 있는 경우</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>역컴파일했을 때 소스 코드안에 하드코딩된 키 값이 발견되는 경우가 있다. 
</li>
<li>말할 것도 없이 취약하다. 
</li>
<li>어떻게 개선해야 할까?
</li>
<li>키를 KeyChain에 저장하라고 한다.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</li>
<li>또는 키를 암호화해서 저장하라고 한다. <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">순번</th>
<th scope="col" class="left">방법</th>
<th scope="col" class="left">내생각</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">키를 난독화한다. (Obfuscated)</td>
<td class="left">평문보다는 낫지만 언젠가는 키를 복원할 수 있을 것이다.</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">키를 암호화한다. (Encrypted)</td>
<td class="left">키를 암호화하기 위한 키는 어떻게 관리되는가?</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">키를 계산해서 만든다.(Calculated)</td>
<td class="left">키를 만들기위한 키를 저장해둔다는 방법이군&#x2026; 마찬가지로 소스코드 분석을 통해서 복원할 수 있지 않을까?</td>
</tr>

<tr>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>디바이스(안드로이드/iOS)별 안전하게 데이터를 저장하기 위한 API를 사용하라고 한다. <sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>
</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> M3 : 취약한 통신 (Insecure Communication)</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 침투 테스터가 자주 발견하는 시나리오</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 인증서 검사 부족</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>모바일앱은 서버가 제공한 인증서를 검사하지 않고 서버에서 제공한 인증서를 무조건 받아들인다.
</li>
<li>이는 모바일 앱과 엔드 포인트 간의 상호 인증 기능을 파괴한다.
</li>
<li>모바일 앱은 TLS 프록시를 통한 중간자 공격(man-in-the-middle attack)에 취약하다.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> 약한 핸드쉐이크 협상</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>약한 암호화 알고리즘을 사용해서 SSL 핸드쉐이크 하는 경우
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> 개인정보유출</h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li>SSL 대신 비보안 채널을 통해 개인 식별 정보를 전송하는 경우
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> iOS 모범 사례</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>최신 버전의 iOS 기본 클래스는 SSL 암호화 길이 협상을 잘 처리한다. 
</li>
<li>개발자가 이러한 기본 값을 무시하는 코드를 임시로 추가할 때 문제가 발생한다. 
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 안드로이드 모범 사례</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>모든 인증서를 신뢰하는 코드를 삭제한다. 예를 들면 다음과 같은 코드이다.
</li>
<li>org.apache.http.conn.ssl.AllowAllHostnameVerifier 또는 SSLSocketFactory.ALLOW<sub>ALL</sub><sub>HOSTNAME</sub><sub>VERIFIER</sub> 와 같은 코드
</li>
<li>SSLSocketFactory를 확장한 클래스를 사용하는 경우, checkServerTrusted 메서드가 올바르게 구현되어 서버 인증서가 올바르게 검사되는지 확인한다.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> M4 : 취약한 인증 (Insecure Authentication)</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>앱 화면에서 인증이 있더라도 실제로 서버측 기능이 실행될 때는 인증을 하지 않는 경우 (다음 페이지로 넘어간 후에는 인증을 하지 않아도 실행되는 경우 등)
</li>
<li>앱 내에서만 인증을 하고 서버측에서는 하지 않는 경우
</li>
</ul>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 보안대책</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>인증은 모두 서버측에서 처리
</li>
<li>모바일 어플리케이션은 사용자가 모바일 어플리케이션 내에서 폐기할 수 있는 인증토큰을 사용해야 한다. 이렇게 하면 앱이 도난당하거나 분실된 기기에서의 무단 접근을 방지할 수 있다. 
</li>
<li>사용자 인증시에 4자리 암호를 사용하지 않는다.( 더 긴 암호 사용)
</li>
<li>영구 인증은 사전동의 형식으로 구현해야 하며 기본적으로 활성화되어 있으면 안된다.
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> M5 : 불충분한 암호화 (Insufficient Cryptography)</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 시나리오</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 취약한 키 관리 프로세스</h4>
<div class="outline-text-4" id="text-6-1-1">
<ul class="org-ul">
<li>키를 사용자가 읽을 수 있는 곳에 저장한다. (로컬 DB, 소스코드 하드코딩 등)
</li>
<li>또한 바이너리 공격으로 키가 누출될 수도 있다. 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> 커스텀 암호화 프로토콜 제작 및 사용</h4>
</div>



<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> 취약한 알고리즘 및 미검증 알고리즘 사용</h4>
<div class="outline-text-4" id="text-6-1-3">
<ul class="org-ul">
<li>RC2, MD4, MD5, SHA1 등
</li>
</ul>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> M6 : 취약한 권한 부여 (Insecure Authorization)</h2>
</div>




<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> M7 : 취약한 코드 품질 (Client Code Quality)</h2>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> M8 : 코드 변조 (Code Tampering)</h2>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> M9 : 역공학 (Reverse Engineering)</h2>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> M10 : 불필요한 기능 (Extraneous Functionality)</h2>
</div>


<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 참고 자료</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li><a href="https://www.owasp.org/index.php/OWASP_Mobile_Security_Project#tab=Top_10_Mobile_Risks">https://www.owasp.org/index.php/OWASP_Mobile_Security_Project#tab=Top_10_Mobile_Risks</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="https://medium.com/@vixentael/key-management-approaches-for-mobile-apps-57bb4db63906">https://medium.com/@vixentael/key-management-approaches-for-mobile-apps-57bb4db63906</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="https://github.com/OWASP/owasp-mstg/blob/master/Document/0x05d-Testing-Data-Storage.md">https://github.com/OWASP/owasp-mstg/blob/master/Document/0x05d-Testing-Data-Storage.md</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2018-05-31 목 15:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
